{"name":"22:5","price":"O people, if you are in doubt concerning the Resurrection, then We surely created you[1] from dust, then from a drop of sperm[2], then from a clot[3], then from a lump of flesh[4] – formed or unformed[5] – so that We may make it clear to you [Our power]. We settle in the wombs whatever We will for an appointed term. Then We bring you out as infants, then [We nurture you] so that you may reach your maturity. Then some of you die, while others are left to reach decrepit old age so that they may know nothing after having knowledge. You see the land lifeless, then as soon as We send down rain on it, it stirs and swells to life and brings forth every type of pleasant plant.","arabic":"يَٰٓأَيُّهَا ٱلنَّاسُ إِن كُنتُمۡ فِي رَيۡبٖ مِّنَ ٱلۡبَعۡثِ فَإِنَّا خَلَقۡنَٰكُم مِّن تُرَابٖ ثُمَّ مِن نُّطۡفَةٖ ثُمَّ مِنۡ عَلَقَةٖ ثُمَّ مِن مُّضۡغَةٖ مُّخَلَّقَةٖ وَغَيۡرِ مُخَلَّقَةٖ لِّنُبَيِّنَ لَكُمۡۚ وَنُقِرُّ فِي ٱلۡأَرۡحَامِ مَا نَشَآءُ إِلَىٰٓ أَجَلٖ مُّسَمّٗى ثُمَّ نُخۡرِجُكُمۡ طِفۡلٗا ثُمَّ لِتَبۡلُغُوٓاْ أَشُدَّكُمۡۖ وَمِنكُم مَّن يُتَوَفَّىٰ وَمِنكُم مَّن يُرَدُّ إِلَىٰٓ أَرۡذَلِ ٱلۡعُمُرِ لِكَيۡلَا يَعۡلَمَ مِنۢ بَعۡدِ عِلۡمٖ شَيۡـٔٗاۚ وَتَرَى ٱلۡأَرۡضَ هَامِدَةٗ فَإِذَآ أَنزَلۡنَا عَلَيۡهَا ٱلۡمَآءَ ٱهۡتَزَّتۡ وَرَبَتۡ وَأَنۢبَتَتۡ مِن كُلِّ زَوۡجِۭ بَهِيجٖ","category":["22 (Al-Hajj)","Al-Hajj","Surah Al-Hajj","Chapter Al-Hajj","Hajj","Surah Hajj","Chapter Hajj","Al Hajj","Surah Al Hajj","Chapter Al Hajj","Surah 22","Chapter 22","The Pilgrimage","الحَجّ"],"ayahNumber":2600,"juzNumber":17,"footnotes":"[1] i.e., Your father, Adam. [2] Nutfah: zygote, which is resulted from the union of male and female gametes (sperm and egg).\n [3] ‘Alaqah: a clinging clot, which resembles a leech. [4] Mudghah: a chewed piece of meat.\n [5] i.e., formed ending into a healthy embryo, or defective ending in miscarriage.","lang":"en","version":{"key":"english_rwwad","direction":"ltr","language_iso_code":"en","version":"1.0.15","last_update":1711763763,"title":"English Translation - Rowwad Translation Center","description":"Translation of the Quran meanings into Englsih by Rowwad Translation Center in cooperation with Islamhouse.com"}}