{"name":"33:37","price":"And [remember, O Prophet] when you were saying to the one[30] who was favored by Allah[31] and favored by you[32], “Keep your wife and fear Allah.” You were concealing in your heart what Allah was going to reveal[33], and you were fearing people[34], while it was more fitting that you should fear Allah[35]. When Zayd no longer had desire for her, We gave her to you in marriage, so that there would be no restraint for the believers in marrying the ex-wives of their adopted sons when they no longer have desire for them. And Allah’s decree is bound to be fulfilled.","arabic":"وَإِذۡ تَقُولُ لِلَّذِيٓ أَنۡعَمَ ٱللَّهُ عَلَيۡهِ وَأَنۡعَمۡتَ عَلَيۡهِ أَمۡسِكۡ عَلَيۡكَ زَوۡجَكَ وَٱتَّقِ ٱللَّهَ وَتُخۡفِي فِي نَفۡسِكَ مَا ٱللَّهُ مُبۡدِيهِ وَتَخۡشَى ٱلنَّاسَ وَٱللَّهُ أَحَقُّ أَن تَخۡشَىٰهُۖ فَلَمَّا قَضَىٰ زَيۡدٞ مِّنۡهَا وَطَرٗا زَوَّجۡنَٰكَهَا لِكَيۡ لَا يَكُونَ عَلَى ٱلۡمُؤۡمِنِينَ حَرَجٞ فِيٓ أَزۡوَٰجِ أَدۡعِيَآئِهِمۡ إِذَا قَضَوۡاْ مِنۡهُنَّ وَطَرٗاۚ وَكَانَ أَمۡرُ ٱللَّهِ مَفۡعُولٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3570,"juzNumber":22,"footnotes":"[30] It refers to the Prophet's adopted son, Zayd ibn Hārithah, before the adoption was abolished.\n [31] By guiding him to Islam.\n [32] By emancipating him from bondage.\n [33] i.e., the command of Allah to the Prophet (ﷺ) to marry Zaynab bint Jahsh after Zayd divorced her; in order to make clear to people that a man can marry a woman previously married to his adopted son.\n [34] i.e., fear that people may say that he married the former wife of his adopted son.\n [35] By making Allah’s command known to people.","lang":"en","version":{"key":"english_rwwad","direction":"ltr","language_iso_code":"en","version":"1.0.15","last_update":1711763763,"title":"English Translation - Rowwad Translation Center","description":"Translation of the Quran meanings into Englsih by Rowwad Translation Center in cooperation with Islamhouse.com"}}