{"name":"5:3","price":"Forbidden[5] to you are carrion, blood[6], the flesh of swine, and that which is sacrificed to other than Allah; and that which is killed by strangling, or by a violent blow, or by a headlong fall, or by being gored; and that which is partly eaten by a predator unless you slaughter it [before it dies]; and that which is sacrificed to idols. Also it is forbidden to use arrows [of chance][7] to determine your decisions. This is all evil practice. Today the disbelievers have lost all hope in [eliminating] your religion, so do not fear them but fear Me. Today I have perfected your religion for you, completed My favor upon you, and have chosen Islam as your religion. But if anyone is compelled by severe hunger, not intending to sin, then Allah is All-Forgiving, Most Merciful.","arabic":"حُرِّمَتۡ عَلَيۡكُمُ ٱلۡمَيۡتَةُ وَٱلدَّمُ وَلَحۡمُ ٱلۡخِنزِيرِ وَمَآ أُهِلَّ لِغَيۡرِ ٱللَّهِ بِهِۦ وَٱلۡمُنۡخَنِقَةُ وَٱلۡمَوۡقُوذَةُ وَٱلۡمُتَرَدِّيَةُ وَٱلنَّطِيحَةُ وَمَآ أَكَلَ ٱلسَّبُعُ إِلَّا مَا ذَكَّيۡتُمۡ وَمَا ذُبِحَ عَلَى ٱلنُّصُبِ وَأَن تَسۡتَقۡسِمُواْ بِٱلۡأَزۡلَٰمِۚ ذَٰلِكُمۡ فِسۡقٌۗ ٱلۡيَوۡمَ يَئِسَ ٱلَّذِينَ كَفَرُواْ مِن دِينِكُمۡ فَلَا تَخۡشَوۡهُمۡ وَٱخۡشَوۡنِۚ ٱلۡيَوۡمَ أَكۡمَلۡتُ لَكُمۡ دِينَكُمۡ وَأَتۡمَمۡتُ عَلَيۡكُمۡ نِعۡمَتِي وَرَضِيتُ لَكُمُ ٱلۡإِسۡلَٰمَ دِينٗاۚ فَمَنِ ٱضۡطُرَّ فِي مَخۡمَصَةٍ غَيۡرَ مُتَجَانِفٖ لِّإِثۡمٖ فَإِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":672,"juzNumber":6,"footnotes":"[5] See 2:173, 5:90.\n [6] What is unlawful is running blood, not the blood captured in vessels after slaughter.\n [7] Al-istiqsām bi al-azlām (lit. divining by casting lots): This was an Arab practice before Islam, whereby they had three lots (flat marked pieces of wood) dedicated to divinations. On each there was written either: “My Lord commanded me”, “My Lord forbade me”, or nothing at all. A person would abide by what the lot told him, but if he drew the empty one, he would recast again until he drew either one of the other two. [cf. al-Tabarī, Ibn Kathīr, al-Sa‘dī]","lang":"en"}