{"name":"60:10","price":"O you who believe, when the believing women come to you as migrants, test their sincerity, although Allah knows best about their faith. Then if you find them to be believers, do not send them back to the disbelievers; they are not lawful [wives] for them, nor are they lawful [husbands] for them. But give the disbelievers whatever [dowries] they have spent[4]. And there is no blame on you if you marry them, as long as you give them their dowries. Do not hold on to the marriage ties with the disbelieving women[5]; ask for repayment of whatever [dowries] you have spent, and let the disbelievers ask for repayment of whatever [dowries] they have spent[6]. This is the ruling of Allah that He judges between you, and Allah is All-Knowing, All-Wise.","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا جَآءَكُمُ ٱلۡمُؤۡمِنَٰتُ مُهَٰجِرَٰتٖ فَٱمۡتَحِنُوهُنَّۖ ٱللَّهُ أَعۡلَمُ بِإِيمَٰنِهِنَّۖ فَإِنۡ عَلِمۡتُمُوهُنَّ مُؤۡمِنَٰتٖ فَلَا تَرۡجِعُوهُنَّ إِلَى ٱلۡكُفَّارِۖ لَا هُنَّ حِلّٞ لَّهُمۡ وَلَا هُمۡ يَحِلُّونَ لَهُنَّۖ وَءَاتُوهُم مَّآ أَنفَقُواْۚ وَلَا جُنَاحَ عَلَيۡكُمۡ أَن تَنكِحُوهُنَّ إِذَآ ءَاتَيۡتُمُوهُنَّ أُجُورَهُنَّۚ وَلَا تُمۡسِكُواْ بِعِصَمِ ٱلۡكَوَافِرِ وَسۡـَٔلُواْ مَآ أَنفَقۡتُمۡ وَلۡيَسۡـَٔلُواْ مَآ أَنفَقُواْۚ ذَٰلِكُمۡ حُكۡمُ ٱللَّهِ يَحۡكُمُ بَيۡنَكُمۡۖ وَٱللَّهُ عَلِيمٌ حَكِيمٞ","category":["60 (Al-Mumtahanah)","Al-Mumtahanah","Surah Al-Mumtahanah","Chapter Al-Mumtahanah","Mumtahanah","Surah Mumtahanah","Chapter Mumtahanah","Al Mumtahanah","Surah Al Mumtahanah","Chapter Al Mumtahanah","Surah 60","Chapter 60","She that is to be Examined","الممتحنة"],"ayahNumber":5160,"juzNumber":28,"footnotes":"[4] i.e., compensate for their loss. [5] i.e., do not stop them from joining the disbelievers.\n [6] If a disbelieving wife opted to join the disbelievers, a Muslim husband could demand in return the equivalent of her dowries. Similarly, the disbelievers had a similar right if a believing woman joined the Muslims. This and the following verses were revealed after the Treaty of al-Hudaybiyyah.","lang":"en","version":{"key":"english_rwwad","direction":"ltr","language_iso_code":"en","version":"1.0.15","last_update":1711763763,"title":"English Translation - Rowwad Translation Center","description":"Translation of the Quran meanings into Englsih by Rowwad Translation Center in cooperation with Islamhouse.com"}}