{"name":"73:20","price":"Indeed, your Lord knows that you [O Prophet] stand up in prayer for nearly two-thirds of the night, or half of it, or one-third of it, as do others among your companions. Allah determines the night and the day; He knows that you [Muslims] cannot keep an accurate count of it, so He pardoned you[7]. Recite then as much of the Qur’an as is easy for you [in the night prayers]. He knows that there are some among you who will be ill, and others traveling in the land, seeking the grace of Allah, and others fighting in Allah’s way. So recite as much of it as is easy for you; establish prayer and give zakah; and lend to Allah a goodly loan[8]. Whatever good you send forth for yourselves, you will find it with Allah, much better in condition and much greater in reward[9]. And seek forgiveness of Allah, for indeed Allah is All-Forgiving, Most-Merciful.","arabic":"۞ إِنَّ رَبَّكَ يَعۡلَمُ أَنَّكَ تَقُومُ أَدۡنَىٰ مِن ثُلُثَيِ ٱلَّيۡلِ وَنِصۡفَهُۥ وَثُلُثَهُۥ وَطَآئِفَةٞ مِّنَ ٱلَّذِينَ مَعَكَۚ وَٱللَّهُ يُقَدِّرُ ٱلَّيۡلَ وَٱلنَّهَارَۚ عَلِمَ أَن لَّن تُحۡصُوهُ فَتَابَ عَلَيۡكُمۡۖ فَٱقۡرَءُواْ مَا تَيَسَّرَ مِنَ ٱلۡقُرۡءَانِۚ عَلِمَ أَن سَيَكُونُ مِنكُم مَّرۡضَىٰ وَءَاخَرُونَ يَضۡرِبُونَ فِي ٱلۡأَرۡضِ يَبۡتَغُونَ مِن فَضۡلِ ٱللَّهِ وَءَاخَرُونَ يُقَٰتِلُونَ فِي سَبِيلِ ٱللَّهِۖ فَٱقۡرَءُواْ مَا تَيَسَّرَ مِنۡهُۚ وَأَقِيمُواْ ٱلصَّلَوٰةَ وَءَاتُواْ ٱلزَّكَوٰةَ وَأَقۡرِضُواْ ٱللَّهَ قَرۡضًا حَسَنٗاۚ وَمَا تُقَدِّمُواْ لِأَنفُسِكُم مِّنۡ خَيۡرٖ تَجِدُوهُ عِندَ ٱللَّهِ هُوَ خَيۡرٗا وَأَعۡظَمَ أَجۡرٗاۚ وَٱسۡتَغۡفِرُواْ ٱللَّهَۖ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمُۢ","category":["73 (Al-Muzzammil)","Al-Muzzammil","Surah Al-Muzzammil","Chapter Al-Muzzammil","Muzzammil","Surah Muzzammil","Chapter Muzzammil","Al Muzzammil","Surah Al Muzzammil","Chapter Al Muzzammil","Surah 73","Chapter 73","The Enshrouded One","المزمل"],"ayahNumber":5495,"juzNumber":29,"footnotes":"[7] The ruling mentioned at the beginning of this surah is lightened here. So from now on, the believers do not have to stick to any of the portions specified there; rather, they can pray whatever they can at night. It is out of the mercy of Allah upon His servants that He does not want hardship for them.\n [8] i.e., giving in charity and for His causes.\n [9] It will be rewarded tenfold, or 700-fold, and Allah gives even more to whoever He wills. See 2:261.","lang":"en","version":{"key":"english_rwwad","direction":"ltr","language_iso_code":"en","version":"1.0.15","last_update":1711763763,"title":"English Translation - Rowwad Translation Center","description":"Translation of the Quran meanings into Englsih by Rowwad Translation Center in cooperation with Islamhouse.com"}}