{"name":"74:31","price":"We have only appointed angels as keepers of the Fire, and We have only made their number as a test for the disbelievers[8], so that those who were given the Scripture may have certainty and the believers may increase in faith; and neither those who were given the Scripture nor the believers may have any doubts; and so that those [hypocrites] in whose hearts is sickness and the disbelievers may say, “What does Allah mean by this number?” Thus Allah causes to stray whom He wills and guides whom He wills, and none knows the soldiers of your Lord but He. This is but a reminder to mankind.","arabic":"وَمَا جَعَلۡنَآ أَصۡحَٰبَ ٱلنَّارِ إِلَّا مَلَٰٓئِكَةٗۖ وَمَا جَعَلۡنَا عِدَّتَهُمۡ إِلَّا فِتۡنَةٗ لِّلَّذِينَ كَفَرُواْ لِيَسۡتَيۡقِنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ وَيَزۡدَادَ ٱلَّذِينَ ءَامَنُوٓاْ إِيمَٰنٗا وَلَا يَرۡتَابَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ وَٱلۡمُؤۡمِنُونَ وَلِيَقُولَ ٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٞ وَٱلۡكَٰفِرُونَ مَاذَآ أَرَادَ ٱللَّهُ بِهَٰذَا مَثَلٗاۚ كَذَٰلِكَ يُضِلُّ ٱللَّهُ مَن يَشَآءُ وَيَهۡدِي مَن يَشَآءُۚ وَمَا يَعۡلَمُ جُنُودَ رَبِّكَ إِلَّا هُوَۚ وَمَا هِيَ إِلَّا ذِكۡرَىٰ لِلۡبَشَرِ","category":["74 (Al-Muddathir)","Al-Muddathir","Surah Al-Muddathir","Chapter Al-Muddathir","Muddathir","Surah Muddathir","Chapter Muddathir","Al Muddathir","Surah Al Muddathir","Chapter Al Muddathir","Surah 74","Chapter 74","The Cloaked One","المدثر"],"ayahNumber":5526,"juzNumber":29,"footnotes":"[8] To say what they want to say, so their punishment will be multiplied for them. Abu Jahl, one of the chief pagans in Makkah, made fun of the Prophet (ﷺ) when they came to know that the keepers of Hell are nineteen angels, so he ridiculed this number and said that it is an easy number to overcome.","lang":"en","version":{"key":"english_rwwad","direction":"ltr","language_iso_code":"en","version":"1.0.15","last_update":1711763763,"title":"English Translation - Rowwad Translation Center","description":"Translation of the Quran meanings into Englsih by Rowwad Translation Center in cooperation with Islamhouse.com"}}